## Web Scraping

In [30]:
import pandas as pd
import unicodedata
import yfinance as yf

In [10]:
# read the Wiki page
const_raw = pd.read_html("https://en.wikipedia.org/wiki/Dow_Jones_Industrial_Average")[1]

In [11]:
const_raw.head()

,Company,Exchange,Symbol,Industry,Date added,Notes,Index weighting
0,3M,NYSE,MMM,Conglomerate,1976-08-09,As Minnesota Mining and Manufacturing,3.84%
1,American Express,NYSE,AXP,Financial services,1982-08-30,NaN,2.88%
2,Amgen,NASDAQ,AMGN,Pharmaceutical industry,2020-08-31,NaN,4.87%
3,Apple Inc.,NASDAQ,AAPL,Information technology,2015-03-19,NaN,2.57%
4,Boeing,NYSE,BA,Aerospace and defense,1987-03-12,NaN,4.92%

In [12]:
const = const_raw.iloc[:, :5].copy()
const.head()

            Company Exchange Symbol                 Industry  Date added
0                3M     NYSE    MMM             Conglomerate  1976-08-09
1  American Express     NYSE    AXP       Financial services  1982-08-30
2             Amgen   NASDAQ   AMGN  Pharmaceutical industry  2020-08-31
3        Apple Inc.   NASDAQ   AAPL   Information technology  2015-03-19
4            Boeing     NYSE     BA    Aerospace and defense  1987-03-12

In [13]:
const.rename(columns = {"Date added":"Date_Added"}, inplace = True)
const.head()

            Company Exchange Symbol                 Industry  Date_Added
0                3M     NYSE    MMM             Conglomerate  1976-08-09
1  American Express     NYSE    AXP       Financial services  1982-08-30
2             Amgen   NASDAQ   AMGN  Pharmaceutical industry  2020-08-31
3        Apple Inc.   NASDAQ   AAPL   Information technology  2015-03-19
4            Boeing     NYSE     BA    Aerospace and defense  1987-03-12

In [15]:
const['Date_Added'] = pd.to_datetime(const.Date_Added)

In [16]:
const.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Company     30 non-null     object
 1   Exchange    30 non-null     object
 2   Symbol      30 non-null     object
 3   Industry    30 non-null     object
 4   Date_Added  30 non-null     datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 1.3+ KB

## Normalizing Unicode Strings and Getting the Ticker Symbols

In [21]:
import unicodedata

In [23]:
const.Symbol[1]

'AXP'

In [18]:
const.Symbol.to_list()

['MMM',
 'AXP',
 'AMGN',
 'AAPL',
 'BA',
 'CAT',
 'CVX',
 'CSCO',
 'KO',
 'DOW',
 'GS',
 'HD',
 'HON',
 'IBM',
 'INTC',
 'JNJ',
 'JPM',
 'MCD',
 'MRK',
 'MSFT',
 'NKE',
 'PG',
 'CRM',
 'TRV',
 'UNH',
 'VZ',
 'V',
 'WBA',
 'WMT',
 'DIS']

In [19]:
const.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Company     30 non-null     object
 1   Exchange    30 non-null     object
 2   Symbol      30 non-null     object
 3   Industry    30 non-null     object
 4   Date_Added  30 non-null     datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 1.3+ KB

In [22]:
const.Symbol.apply(lambda x: unicodedata.normalize("NFKD", x))

0      MMM
1      AXP
2     AMGN
3     AAPL
4       BA
5      CAT
6      CVX
7     CSCO
8       KO
9      DOW
10      GS
11      HD
12     HON
13     IBM
14    INTC
15     JNJ
16     JPM
17     MCD
18     MRK
19    MSFT
20     NKE
21      PG
22     CRM
23     TRV
24     UNH
25      VZ
26       V
27     WBA
28     WMT
29     DIS
Name: Symbol, dtype: object

In [24]:
const.Symbol = const.Symbol.apply(lambda x: unicodedata.normalize("NFKD", x))

In [25]:
const["Ticker"] = const.Symbol.str.split(": ").apply(lambda x: x[-1])

In [27]:
ticker_list = const.Ticker.to_list()

In [28]:
const.to_csv("const.csv", index = False)

## Loading and Saving Historical Stock Prices

In [31]:
prices = yf.download(ticker_list, start = "2007-01-01", end = "2020-03-31")

[*********************100%***********************]  30 of 30 completed

In [32]:
prices.head()

           Adj Close                                                      \
                AAPL       AMGN        AXP         BA        CAT     CRM
Date
2007-01-03  2.573566  54.126312  47.838795  64.405731  40.944595  9.0175
2007-01-04  2.630688  56.444851  47.490051  64.665741  40.837482  9.4700
2007-01-05  2.611954  56.579399  46.863956  64.391273  40.315292  9.8800
2007-01-08  2.624853  56.128361  47.307781  64.239609  40.362164  9.9825
2007-01-09  2.842900  56.397388  47.006588  63.560661  40.583073  9.9900

                                                 ...    Volume            \
                 CSCO        CVX        DIS DOW  ...       MRK      MSFT
Date                                             ...
2007-01-03  20.589767  41.455723  28.317101 NaN  ...  15019300  76935100
2007-01-04  21.131788  41.052643  28.540649 NaN  ...  12515200  45774500
2007-01-05  21.139219  41.210381  28.308815 NaN  ...  10656900  44607200
2007-01-08  21.258024  41.736099  28.565489 NaN  ...   7046300  50220200
2007-01-09  21.139219  41.257103  28.524090 NaN  ...   8623200  44636600

                                                                         \
                 NKE        PG      TRV      UNH   V        VZ      WBA
Date
2007-01-03  17299200   9717900  3432800  8360300 NaN  21445850  6294500
2007-01-04  15085600   8711400  2068200  5152500 NaN  19215860  3681800
2007-01-05  14996800   9907900  2104600  6215700 NaN  19047041  3680900
2007-01-08  10109600  11068200  2440900  4344100 NaN  20370917  4720800
2007-01-09  15167200  10823800  1319500  5483900 NaN  16281352  3792500


                 WMT
Date
2007-01-03  35687300
2007-01-04  17073000
2007-01-05  13556900
2007-01-08  16396400
2007-01-09  14643200

[5 rows x 180 columns]

In [33]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3333 entries, 2007-01-03 to 2020-03-30
Columns: 180 entries, ('Adj Close', 'AAPL') to ('Volume', 'WMT')
dtypes: float64(152), int64(28)
memory usage: 4.6 MB

In [34]:
prices = prices.loc[:,"Close"].copy()

In [35]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3333 entries, 2007-01-03 to 2020-03-30
Data columns (total 30 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    3333 non-null   float64
 1   AMGN    3333 non-null   float64
 2   AXP     3333 non-null   float64
 3   BA      3333 non-null   float64
 4   CAT     3333 non-null   float64
 5   CRM     3333 non-null   float64
 6   CSCO    3333 non-null   float64
 7   CVX     3333 non-null   float64
 8   DIS     3333 non-null   float64
 9   DOW     260 non-null    float64
 10  GS      3333 non-null   float64
 11  HD      3333 non-null   float64
 12  HON     3333 non-null   float64
 13  IBM     3333 non-null   float64
 14  INTC    3333 non-null   float64
 15  JNJ     3333 non-null   float64
 16  JPM     3333 non-null   float64
 17  KO      3333 non-null   float64
 18  MCD     3333 non-null   float64
 19  MMM     3333 non-null   float64
 20  MRK     3333 non-null   float64
 21  MSFT    3333 non-null   float64
 22  NKE     3333 non-null   float64
 23  PG      3333 non-null   float64
 24  TRV     3333 non-null   float64
 25  UNH     3333 non-null   float64
 26  V       3029 non-null   float64
 27  VZ      3333 non-null   float64
 28  WBA     3333 non-null   float64
 29  WMT     3333 non-null   float64
dtypes: float64(30)
memory usage: 807.2 KB

In [36]:
prices.to_csv("const_prices.csv")

In [37]:
dji = yf.download("^DJI", start = "2007-01-01",  end = "2020-03-31")

[*********************100%***********************]  1 of 1 completed

In [38]:
dji.head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2007-01-03,12459.540039,12580.349609,12404.820312,12474.519531,12474.519531,3272000
2007-01-04,12473.160156,12510.410156,12403.860352,12480.690430,12480.690430,2590600
2007-01-05,12480.049805,12480.129883,12365.410156,12398.009766,12398.009766,2352200
2007-01-08,12392.009766,12445.919922,12337.370117,12423.490234,12423.490234,2235000
2007-01-09,12424.769531,12466.429688,12369.169922,12416.599609,12416.599609,2251900

In [39]:
dji.to_csv("dji.csv")

In [40]:
dji.to_csv("dji.csv")